#+TAGS: UNRESOLVED(u) QUESTIONS(q) EXTRA(e) REQUIRED(r) TOBEORG(t)
*** Q6: Quine
   
    #+begin_src python :results output
      s = 'print("s = " + repr(s) + "; eval(s)")'; eval(s)
    #+end_src 

    #+RESULTS:
    : s = 'print("s = " + repr(s) + "; eval(s)")'; eval(s)
    
    - ~repr(object)~ vs ~str(object)~
      - ~str()~ is used for creating output for *end user* while ~repr()~ is mainly used for *debugging and development*. ~repr~ ’s goal is to be *unambiguous* and ~str~ ’s is to be *readable*. For example, if we suspect a float has a *small rounding error*, ~repr~ will show us while ~str~ may not.
      - ~repr()~ compute the *“official”* string representation of an *object* (a representation that has *all information* about the abject) and ~str()~ is used to compute the *“informal”* string representation of an *object* (a representation that is *useful for printing* the object).
      - The ~print~ statement and ~str()~ built-in function uses ~__str__~ to display the string representation of the object while the ~repr()~ built-in function uses ~__repr__~ to display the object.
       
      #+begin_src python :results output
        import datetime 
        today = datetime.datetime.now() 
        # Prints readable format for date-time object 
        print(str(today))

        # prints the official format of date-time object 
        print(repr(today))
      #+end_src 

      #+RESULTS:
      : 2019-04-22 19:36:13.823131
      : datetime.datetime(2019, 4, 22, 19, 36, 13, 823131)

    - ~eval(expression, globals=None, locals=None)~
      - ~expression~: this *string* is *parsed and evaluated* as a Python expression
      - ~globals~ (optional): a *dictionary* to specify the available *global methods and variables*
      - ~locals~ (optional): another *dictionary* to specify the available *local methods and variables* 
